# Дано трехзначное число. Найти число, полученное при перестановке второй и
# третьей цифр заданного числа

a = input('Введите трехзначное число: ')
result = a[0] + a[2] + a[1]
print(result)

# print(f'Новое число: {result}')