osadki_1 = [1.0, 3.4, 8.4, 3.4, 1.0, 3.4, 8.4, 3.4, 1.0, 3.4,
            8.4, 3.4, 1.0, 3.4, 8.4, 3.4, 1.0, 3.4, 8.4, 3.4,
            1.0, 3.4, 8.4, 3.4, 1.0, 3.4, 8.4, 3.4, 1.0, 3.4,
            8.4]

osadki_2 = [2.6, 7.1, 1.6, 9.1, 2.6, 7.1, 1.6, 9.1, 2.6, 7.1,
            1.6, 9.1, 2.6, 7.1, 1.6, 9.1, 2.6, 7.1, 1.6, 9.1,
            2.6, 7.1, 1.6, 9.1, 2.6, 7.1, 1.6, 9.1, 2.6, 7.1,
            1.6]

sum_1 = 0
sum_2 = 0

for i in osadki_1:
    sum_1 += i

for i in osadki_2:
    sum_2 += i

sr1 = round(sum_1 / len(osadki_1), 2)
sr2 = round(sum_2 / len(osadki_2), 2)

print(f'Среднедневное кол-во осадков за январь: {sr1}')
print(f'Среднедневное кол-во осадков за март: {sr2}')
