# 1 Вариант


a = int(input("Введите первую сторону стола: "))
b = int(input("Введите вторую сторону стола: "))
c = int(input("Введите первую сторону кости домино: "))
d = int(input("Введите вторую сторону кости домино: "))
e = int(input("Введите третью сторону кости домино: "))

x1 = a * b
x2 = c * d
x3 = c * e
x4 = d * e


if x1 >= x2:
    print("Разместится")
elif x1 >= x3:
    print("Разместится")
elif (x1 >= x4):
    print("Разместится")
else:
    print("Не разместится")


# //2 Вариант
# a = 20;
# b = 10;
# c = 8;
# d = 6;
# e = 2;
 
# x1 = a * b;
# x2 = c * d;
# x3 = c * e;
# x4 = d * e;
# const minSquare = Math.min(x1, x2, x3, x4);
# console.log("Разместится на столе сторона домино площадью: " + minSquare)